<!-- tfplan-comment -->
## Terraform plan (Cloudflare DNS)

Commit: fc8fba4cf854039520dfc4f53678149fa64763f5

<details><summary>Show plan</summary>

```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # cloudflare_ruleset.redirects will be updated in-place
  ~ resource "cloudflare_ruleset" "redirects" {
        id           = "3ae06cd2cf254b50b6e9ef328c5fa356"
      ~ last_updated = "2026-01-21T13:16:32Z" -> (known after apply)
        name         = "Redirect rules"
      ~ rules        = [
          ~ {
              ~ id                = "6a698be9f6004f3fb02d562746d678ff" -> (known after apply)
              + logging           = (known after apply)
              ~ ref               = "6a698be9f6004f3fb02d562746d678ff" -> (known after apply)
                # (5 unchanged attributes hidden)
            },
          ~ {
              ~ description       = "Redirect searle.dev/govision/* to govision.app/*" -> "Redirect searle.dev/govision/* to govision.app/* (except proxy requests)"
              ~ expression        = "(http.host eq \"searle.dev\" and starts_with(http.request.uri.path, \"/govision\"))" -> "(http.host eq \"searle.dev\" and starts_with(http.request.uri.path, \"/govision\") and not any(http.request.headers[\"x-govision-proxy\"][*] eq \"1\"))"
              ~ id                = "dc8e1385fe7648618d04ef49583d45c8" -> (known after apply)
              + logging           = (known after apply)
              ~ ref               = "dc8e1385fe7648618d04ef49583d45c8" -> (known after apply)
                # (3 unchanged attributes hidden)
            },
        ]
      ~ version      = "2" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # cloudflare_workers_script.govision_app_proxy will be updated in-place
  ~ resource "cloudflare_workers_script" "govision_app_proxy" {
      ~ bindings            = [] -> (known after apply)
      ~ content_sha256      = "c7dee71c70e2919f5001d12ca3a22bc08ea6599074d1a6973659c3d78cfd61fa" -> "06de5c26bd52dce8c602b0629eb3e509d9c1afa1a0a9ea943f2971e2dbad8978"
      ~ etag                = "e5ea4c1c5350281c8db076af3c9fd0b8606c0667a9884737687f7574e595975e" -> (known after apply)
      ~ handlers            = [
          - "fetch",
        ] -> (known after apply)
      ~ has_assets          = false -> (known after apply)
      ~ has_modules         = true -> (known after apply)
        id                  = "govision-app-proxy"
      ~ last_deployed_from  = "terraform" -> (known after apply)
      + migration_tag       = (known after apply)
      ~ modified_on         = "2026-01-21T13:16:32Z" -> (known after apply)
      + named_handlers      = (known after apply)
      + placement           = (known after apply)
      ~ startup_time_ms     = 0 -> (known after apply)
      ~ tail_consumers      = [] -> (known after apply)
        # (10 unchanged attributes hidden)
    }

Plan: 0 to add, 2 to change, 0 to destroy.


```
</details>